app/controllers/records_controller.rb

  def create
    @record = Record.new(record_params)

    if @record.save
---
INSERT INTO "records" ("title", "amount", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Record 3"], ["amount", 50.0], ["date", "2015-07-26"], ["created_at", "2015-07-26 13:21:06.854055"], ["updated_at", "2015-07-26 13:21:06.854055"]]